# Formula Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyParameter..::..Formula Property
FamilyParameter Class See Also
---
The formula.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Formula { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Formula As String
	Get
```

Visual C++
---
```text
public:
property String^ Formula {
	String^ get ();
}
```

# Remarks
Returns nullNothingnullptra null reference (Nothing in Visual Basic) if there is no formula governing this parameter.
# See Also
FamilyParameter Class
Autodesk.Revit.DB Namespace